MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define _C2FIFO_FNRB2_POSITION                   0x00000002
#define _C2FIFO_FNRB2_MASK                       0x00000004
#define _C2FIFO_FNRB2_LENGTH                     0x00000001

#define _C2FIFO_FNRB3_POSITION                   0x00000003
#define _C2FIFO_FNRB3_MASK                       0x00000008
#define _C2FIFO_FNRB3_LENGTH                     0x00000001

#define _C2FIFO_FNRB4_POSITION                   0x00000004
#define _C2FIFO_FNRB4_MASK                       0x00000010
#define _C2FIFO_FNRB4_LENGTH                     0x00000001

#define _C2FIFO_FNRB5_POSITION                   0x00000005
#define _C2FIFO_FNRB5_MASK                       0x00000020
#define _C2FIFO_FNRB5_LENGTH                     0x00000001

#define _C2FIFO_FBP0_POSITION                    0x00000008
#define _C2FIFO_FBP0_MASK                        0x00000100
#define _C2FIFO_FBP0_LENGTH                      0x00000001

#define _C2FIFO_FBP1_POSITION                    0x00000009
#define _C2FIFO_FBP1_MASK                        0x00000200
#define _C2FIFO_FBP1_LENGTH                      0x00000001

#define _C2FIFO_FBP2_POSITION                    0x0000000A
#define _C2FIFO_FBP2_MASK                        0x00000400
#define _C2FIFO_FBP2_LENGTH                      0x00000001

#define _C2FIFO_FBP3_POSITION                    0x0000000B
#define _C2FIFO_FBP3_MASK                        0x00000800
#define _C2FIFO_FBP3_LENGTH                      0x00000001

#define _C2FIFO_FBP4_POSITION                    0x0000000C
#define _C2FIFO_FBP4_MASK                        0x00001000
#define _C2FIFO_FBP4_LENGTH                      0x00000001

#define _C2FIFO_FBP5_POSITION                    0x0000000D
#define _C2FIFO_FBP5_MASK                        0x00002000
#define _C2FIFO_FBP5_LENGTH                      0x00000001

#define _C2INTF_TBIF_POSITION                    0x00000000
#define _C2INTF_TBIF_MASK                        0x00000001
#define _C2INTF_TBIF_LENGTH                      0x00000001

#define _C2INTF_RBIF_POSITION                    0x00000001
#define _C2INTF_RBIF_MASK                        0x00000002
#define _C2INTF_RBIF_LENGTH                      0x00000001

#define _C2INTF_RBOVIF_POSITION                  0x00000002
#define _C2INTF_RBOVIF_MASK                      0x00000004
#define _C2INTF_RBOVIF_LENGTH                    0x00000001

#define _C2INTF_FIFOIF_POSITION                  0x00000003
#define _C2INTF_FIFOIF_MASK                      0x00000008
#define _C2INTF_FIFOIF_LENGTH                    0x00000001

#define _C2INTF_ERRIF_POSITION                   0x00000005
#define _C2INTF_ERRIF_MASK                       0x00000020
#define _C2INTF_ERRIF_LENGTH                     0x00000001

#define _C2INTF_WAKIF_POSITION                   0x00000006
#define _C2INTF_WAKIF_MASK                       0x00000040
#define _C2INTF_WAKIF_LENGTH                     0x00000001

#define _C2INTF_IVRIF_POSITION                   0x00000007
#define _C2INTF_IVRIF_MASK                       0x00000080
#define _C2INTF_IVRIF_LENGTH                     0x00000001

#define _C2INTF_EWARN_POSITION                   0x00000008
#define _C2INTF_EWARN_MASK                       0x00000100
#define _C2INTF_EWARN_LENGTH                     0x00000001

#define _C2INTF_RXWAR_POSITION                   0x00000009
#define _C2INTF_RXWAR_MASK                       0x00000200
#define _C2INTF_RXWAR_LENGTH                     0x00000001

#define _C2INTF_TXWAR_POSITION                   0x0000000A
#define _C2INTF_TXWAR_MASK                       0x00000400
#define _C2INTF_TXWAR_LENGTH                     0x00000001

#define _C2INTF_RXBP_POSITION                    0x0000000B
#define _C2INTF_RXBP_MASK                        0x00000800
#define _C2INTF_RXBP_LENGTH                      0x00000001

#define _C2INTF_TXBP_POSITION                    0x0000000C
#define _C2INTF_TXBP_MASK                        0x00001000
#define _C2INTF_TXBP_LENGTH                      0x00000001

#define _C2INTF_TXBO_POSITION                    0x0000000D
#define _C2INTF_TXBO_MASK                        0x00002000
#define _C2INTF_TXBO_LENGTH                      0x00000001

#define _C2INTE_TBIE_POSITION                    0x00000000
#define _C2INTE_TBIE_MASK                        0x00000001
#define _C2INTE_TBIE_LENGTH                      0x00000001

#define _C2INTE_RBIE_POSITION                    0x00000001
#define _C2INTE_RBIE_MASK                        0x00000002
#define _C2INTE_RBIE_LENGTH                      0x00000001

#define _C2INTE_RBOVIE_POSITION                  0x00000002
#define _C2INTE_RBOVIE_MASK                      0x00000004
#define _C2INTE_RBOVIE_LENGTH                    0x00000001

#define _C2INTE_FIFOIE_POSITION                  0x00000003
#define _C2INTE_FIFOIE_MASK                      0x00000008
#define _C2INTE_FIFOIE_LENGTH                    0x00000001

#define _C2INTE_ERRIE_POSITION                   0x00000005
#define _C2INTE_ERRIE_MASK                       0x00000020
#define _C2INTE_ERRIE_LENGTH                     0x00000001

#define _C2INTE_WAKIE_POSITION                   0x00000006
#define _C2INTE_WAKIE_MASK                       0x00000040
#define _C2INTE_WAKIE_LENGTH                     0x00000001

#define _C2INTE_IVRIE_POSITION                   0x00000007
#define _C2INTE_IVRIE_MASK                       0x00000080
#define _C2INTE_IVRIE_LENGTH                     0x00000001

#define _C2EC_RERRCNT_POSITION                   0x00000000
#define _C2EC_RERRCNT_MASK                       0x000000FF
#define _C2EC_RERRCNT_LENGTH                     0x00000008

#define _C2EC_TERRCNT_POSITION                   0x00000008
#define _C2EC_TERRCNT_MASK                       0x0000FF00
#define _C2EC_TERRCNT_LENGTH                     0x00000008

#define _C2CFG1_BRP_POSITION                     0x00000000
#define _C2CFG1_BRP_MASK                         0x0000003F
#define _C2CFG1_BRP_LENGTH                       0x00000006

#define _C2CFG1_SJW_POSITION                     0x00000006
#define _C2CFG1_SJW_MASK                         0x000000C0
#define _C2CFG1_SJW_LENGTH                       0x00000002

#define _C2CFG1_BRP0_POSITION                    0x00000000
#define _C2CFG1_BRP0_MASK                        0x00000001
#define _C2CFG1_BRP0_LENGTH                      0x00000001

#define _C2CFG1_BRP1_POSITION                    0x00000001
#define _C2CFG1_BRP1_MASK                        0x00000002
#define _C2CFG1_BRP1_LENGTH                      0x00000001

