MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define _CRCXORH_X26_POSITION                    0x0000000A
#define _CRCXORH_X26_MASK                        0x00000400
#define _CRCXORH_X26_LENGTH                      0x00000001

#define _CRCXORH_X27_POSITION                    0x0000000B
#define _CRCXORH_X27_MASK                        0x00000800
#define _CRCXORH_X27_LENGTH                      0x00000001

#define _CRCXORH_X28_POSITION                    0x0000000C
#define _CRCXORH_X28_MASK                        0x00001000
#define _CRCXORH_X28_LENGTH                      0x00000001

#define _CRCXORH_X29_POSITION                    0x0000000D
#define _CRCXORH_X29_MASK                        0x00002000
#define _CRCXORH_X29_LENGTH                      0x00000001

#define _CRCXORH_X30_POSITION                    0x0000000E
#define _CRCXORH_X30_MASK                        0x00004000
#define _CRCXORH_X30_LENGTH                      0x00000001

#define _CRCXORH_X31_POSITION                    0x0000000F
#define _CRCXORH_X31_MASK                        0x00008000
#define _CRCXORH_X31_LENGTH                      0x00000001

#define _RPOR0_RP64R_POSITION                    0x00000000
#define _RPOR0_RP64R_MASK                        0x0000003F
#define _RPOR0_RP64R_LENGTH                      0x00000006

#define _RPOR0_RP65R_POSITION                    0x00000008
#define _RPOR0_RP65R_MASK                        0x00003F00
#define _RPOR0_RP65R_LENGTH                      0x00000006

#define _RPOR0_RP64R0_POSITION                   0x00000000
#define _RPOR0_RP64R0_MASK                       0x00000001
#define _RPOR0_RP64R0_LENGTH                     0x00000001

#define _RPOR0_RP64R1_POSITION                   0x00000001
#define _RPOR0_RP64R1_MASK                       0x00000002
#define _RPOR0_RP64R1_LENGTH                     0x00000001

#define _RPOR0_RP64R2_POSITION                   0x00000002
#define _RPOR0_RP64R2_MASK                       0x00000004
#define _RPOR0_RP64R2_LENGTH                     0x00000001

#define _RPOR0_RP64R3_POSITION                   0x00000003
#define _RPOR0_RP64R3_MASK                       0x00000008
#define _RPOR0_RP64R3_LENGTH                     0x00000001

#define _RPOR0_RP64R4_POSITION                   0x00000004
#define _RPOR0_RP64R4_MASK                       0x00000010
#define _RPOR0_RP64R4_LENGTH                     0x00000001

#define _RPOR0_RP64R5_POSITION                   0x00000005
#define _RPOR0_RP64R5_MASK                       0x00000020
#define _RPOR0_RP64R5_LENGTH                     0x00000001

#define _RPOR0_RP65R0_POSITION                   0x00000008
#define _RPOR0_RP65R0_MASK                       0x00000100
#define _RPOR0_RP65R0_LENGTH                     0x00000001

#define _RPOR0_RP65R1_POSITION                   0x00000009
#define _RPOR0_RP65R1_MASK                       0x00000200
#define _RPOR0_RP65R1_LENGTH                     0x00000001

#define _RPOR0_RP65R2_POSITION                   0x0000000A
#define _RPOR0_RP65R2_MASK                       0x00000400
#define _RPOR0_RP65R2_LENGTH                     0x00000001

#define _RPOR0_RP65R3_POSITION                   0x0000000B
#define _RPOR0_RP65R3_MASK                       0x00000800
#define _RPOR0_RP65R3_LENGTH                     0x00000001

#define _RPOR0_RP65R4_POSITION                   0x0000000C
#define _RPOR0_RP65R4_MASK                       0x00001000
#define _RPOR0_RP65R4_LENGTH                     0x00000001

#define _RPOR0_RP65R5_POSITION                   0x0000000D
#define _RPOR0_RP65R5_MASK                       0x00002000
#define _RPOR0_RP65R5_LENGTH                     0x00000001

#define _RPOR1_RP66R_POSITION                    0x00000000
#define _RPOR1_RP66R_MASK                        0x0000003F
#define _RPOR1_RP66R_LENGTH                      0x00000006

#define _RPOR1_RP67R_POSITION                    0x00000008
#define _RPOR1_RP67R_MASK                        0x00003F00
#define _RPOR1_RP67R_LENGTH                      0x00000006

#define _RPOR1_RP66R0_POSITION                   0x00000000
#define _RPOR1_RP66R0_MASK                       0x00000001
#define _RPOR1_RP66R0_LENGTH                     0x00000001

#define _RPOR1_RP66R1_POSITION                   0x00000001
#define _RPOR1_RP66R1_MASK                       0x00000002
#define _RPOR1_RP66R1_LENGTH                     0x00000001

#define _RPOR1_RP66R2_POSITION                   0x00000002
#define _RPOR1_RP66R2_MASK                       0x00000004
#define _RPOR1_RP66R2_LENGTH                     0x00000001

#define _RPOR1_RP66R3_POSITION                   0x00000003
#define _RPOR1_RP66R3_MASK                       0x00000008
#define _RPOR1_RP66R3_LENGTH                     0x00000001

#define _RPOR1_RP66R4_POSITION                   0x00000004
#define _RPOR1_RP66R4_MASK                       0x00000010
#define _RPOR1_RP66R4_LENGTH                     0x00000001

#define _RPOR1_RP66R5_POSITION                   0x00000005
#define _RPOR1_RP66R5_MASK                       0x00000020
#define _RPOR1_RP66R5_LENGTH                     0x00000001

#define _RPOR1_RP67R0_POSITION                   0x00000008
#define _RPOR1_RP67R0_MASK                       0x00000100
#define _RPOR1_RP67R0_LENGTH                     0x00000001

#define _RPOR1_RP67R1_POSITION                   0x00000009
#define _RPOR1_RP67R1_MASK                       0x00000200
#define _RPOR1_RP67R1_LENGTH                     0x00000001

#define _RPOR1_RP67R2_POSITION                   0x0000000A
#define _RPOR1_RP67R2_MASK                       0x00000400
#define _RPOR1_RP67R2_LENGTH                     0x00000001

#define _RPOR1_RP67R3_POSITION                   0x0000000B
#define _RPOR1_RP67R3_MASK                       0x00000800
#define _RPOR1_RP67R3_LENGTH                     0x00000001

#define _RPOR1_RP67R4_POSITION                   0x0000000C
#define _RPOR1_RP67R4_MASK                       0x00001000
#define _RPOR1_RP67R4_LENGTH                     0x00000001

#define _RPOR1_RP67R5_POSITION                   0x0000000D
#define _RPOR1_RP67R5_MASK                       0x00002000
#define _RPOR1_RP67R5_LENGTH                     0x00000001

#define _RPOR2_RP68R_POSITION                    0x00000000
#define _RPOR2_RP68R_MASK                        0x0000003F
#define _RPOR2_RP68R_LENGTH                      0x00000006

#define _RPOR2_RP69R_POSITION                    0x00000008
#define _RPOR2_RP69R_MASK                        0x00003F00
#define _RPOR2_RP69R_LENGTH                      0x00000006

#define _RPOR2_RP68R0_POSITION                   0x00000000
#define _RPOR2_RP68R0_MASK                       0x00000001
#define _RPOR2_RP68R0_LENGTH                     0x00000001

#define _RPOR2_RP68R1_POSITION                   0x00000001
#define _RPOR2_RP68R1_MASK                       0x00000002
#define _RPOR2_RP68R1_LENGTH                     0x00000001

