MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define _RPOR14_RP120R3_POSITION                 0x00000003
#define _RPOR14_RP120R3_MASK                     0x00000008
#define _RPOR14_RP120R3_LENGTH                   0x00000001

#define _RPOR14_RP120R4_POSITION                 0x00000004
#define _RPOR14_RP120R4_MASK                     0x00000010
#define _RPOR14_RP120R4_LENGTH                   0x00000001

#define _RPOR14_RP120R5_POSITION                 0x00000005
#define _RPOR14_RP120R5_MASK                     0x00000020
#define _RPOR14_RP120R5_LENGTH                   0x00000001

#define _RPOR14_RP125R0_POSITION                 0x00000008
#define _RPOR14_RP125R0_MASK                     0x00000100
#define _RPOR14_RP125R0_LENGTH                   0x00000001

#define _RPOR14_RP125R1_POSITION                 0x00000009
#define _RPOR14_RP125R1_MASK                     0x00000200
#define _RPOR14_RP125R1_LENGTH                   0x00000001

#define _RPOR14_RP125R2_POSITION                 0x0000000A
#define _RPOR14_RP125R2_MASK                     0x00000400
#define _RPOR14_RP125R2_LENGTH                   0x00000001

#define _RPOR14_RP125R3_POSITION                 0x0000000B
#define _RPOR14_RP125R3_MASK                     0x00000800
#define _RPOR14_RP125R3_LENGTH                   0x00000001

#define _RPOR14_RP125R4_POSITION                 0x0000000C
#define _RPOR14_RP125R4_MASK                     0x00001000
#define _RPOR14_RP125R4_LENGTH                   0x00000001

#define _RPOR14_RP125R5_POSITION                 0x0000000D
#define _RPOR14_RP125R5_MASK                     0x00002000
#define _RPOR14_RP125R5_LENGTH                   0x00000001

#define _RPOR15_RP126R_POSITION                  0x00000000
#define _RPOR15_RP126R_MASK                      0x0000003F
#define _RPOR15_RP126R_LENGTH                    0x00000006

#define _RPOR15_RP127R_POSITION                  0x00000008
#define _RPOR15_RP127R_MASK                      0x00003F00
#define _RPOR15_RP127R_LENGTH                    0x00000006

#define _RPOR15_RP126R0_POSITION                 0x00000000
#define _RPOR15_RP126R0_MASK                     0x00000001
#define _RPOR15_RP126R0_LENGTH                   0x00000001

#define _RPOR15_RP126R1_POSITION                 0x00000001
#define _RPOR15_RP126R1_MASK                     0x00000002
#define _RPOR15_RP126R1_LENGTH                   0x00000001

#define _RPOR15_RP126R2_POSITION                 0x00000002
#define _RPOR15_RP126R2_MASK                     0x00000004
#define _RPOR15_RP126R2_LENGTH                   0x00000001

#define _RPOR15_RP126R3_POSITION                 0x00000003
#define _RPOR15_RP126R3_MASK                     0x00000008
#define _RPOR15_RP126R3_LENGTH                   0x00000001

#define _RPOR15_RP126R4_POSITION                 0x00000004
#define _RPOR15_RP126R4_MASK                     0x00000010
#define _RPOR15_RP126R4_LENGTH                   0x00000001

#define _RPOR15_RP126R5_POSITION                 0x00000005
#define _RPOR15_RP126R5_MASK                     0x00000020
#define _RPOR15_RP126R5_LENGTH                   0x00000001

#define _RPOR15_RP127R0_POSITION                 0x00000008
#define _RPOR15_RP127R0_MASK                     0x00000100
#define _RPOR15_RP127R0_LENGTH                   0x00000001

#define _RPOR15_RP127R1_POSITION                 0x00000009
#define _RPOR15_RP127R1_MASK                     0x00000200
#define _RPOR15_RP127R1_LENGTH                   0x00000001

#define _RPOR15_RP127R2_POSITION                 0x0000000A
#define _RPOR15_RP127R2_MASK                     0x00000400
#define _RPOR15_RP127R2_LENGTH                   0x00000001

#define _RPOR15_RP127R3_POSITION                 0x0000000B
#define _RPOR15_RP127R3_MASK                     0x00000800
#define _RPOR15_RP127R3_LENGTH                   0x00000001

#define _RPOR15_RP127R4_POSITION                 0x0000000C
#define _RPOR15_RP127R4_MASK                     0x00001000
#define _RPOR15_RP127R4_LENGTH                   0x00000001

#define _RPOR15_RP127R5_POSITION                 0x0000000D
#define _RPOR15_RP127R5_MASK                     0x00002000
#define _RPOR15_RP127R5_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00007F00
#define _RPINR0_INT1R_LENGTH                     0x00000007

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR0_INT1R6_POSITION                  0x0000000E
#define _RPINR0_INT1R6_MASK                      0x00004000
#define _RPINR0_INT1R6_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000007F
#define _RPINR1_INT2R_LENGTH                     0x00000007

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x00007F00
#define _RPINR1_INT3R_LENGTH                     0x00000007

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

