MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define _RPINR40_DTCMP5R4_POSITION               0x0000000C
#define _RPINR40_DTCMP5R4_MASK                   0x00001000
#define _RPINR40_DTCMP5R4_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R5_POSITION               0x0000000D
#define _RPINR40_DTCMP5R5_MASK                   0x00002000
#define _RPINR40_DTCMP5R5_LENGTH                 0x00000001

#define _RPINR40_DTCMP5R6_POSITION               0x0000000E
#define _RPINR40_DTCMP5R6_MASK                   0x00004000
#define _RPINR40_DTCMP5R6_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R_POSITION                0x00000000
#define _RPINR41_DTCMP6R_MASK                    0x0000007F
#define _RPINR41_DTCMP6R_LENGTH                  0x00000007

#define _RPINR41_DTCMP6R0_POSITION               0x00000000
#define _RPINR41_DTCMP6R0_MASK                   0x00000001
#define _RPINR41_DTCMP6R0_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R1_POSITION               0x00000001
#define _RPINR41_DTCMP6R1_MASK                   0x00000002
#define _RPINR41_DTCMP6R1_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R2_POSITION               0x00000002
#define _RPINR41_DTCMP6R2_MASK                   0x00000004
#define _RPINR41_DTCMP6R2_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R3_POSITION               0x00000003
#define _RPINR41_DTCMP6R3_MASK                   0x00000008
#define _RPINR41_DTCMP6R3_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R4_POSITION               0x00000004
#define _RPINR41_DTCMP6R4_MASK                   0x00000010
#define _RPINR41_DTCMP6R4_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R5_POSITION               0x00000005
#define _RPINR41_DTCMP6R5_MASK                   0x00000020
#define _RPINR41_DTCMP6R5_LENGTH                 0x00000001

#define _RPINR41_DTCMP6R6_POSITION               0x00000006
#define _RPINR41_DTCMP6R6_MASK                   0x00000040
#define _RPINR41_DTCMP6R6_LENGTH                 0x00000001

#define _RPINR42_FLT5R_POSITION                  0x00000000
#define _RPINR42_FLT5R_MASK                      0x0000007F
#define _RPINR42_FLT5R_LENGTH                    0x00000007

#define _RPINR42_FLT6R_POSITION                  0x00000008
#define _RPINR42_FLT6R_MASK                      0x00007F00
#define _RPINR42_FLT6R_LENGTH                    0x00000007

#define _RPINR42_FLT5R0_POSITION                 0x00000000
#define _RPINR42_FLT5R0_MASK                     0x00000001
#define _RPINR42_FLT5R0_LENGTH                   0x00000001

#define _RPINR42_FLT5R1_POSITION                 0x00000001
#define _RPINR42_FLT5R1_MASK                     0x00000002
#define _RPINR42_FLT5R1_LENGTH                   0x00000001

#define _RPINR42_FLT5R2_POSITION                 0x00000002
#define _RPINR42_FLT5R2_MASK                     0x00000004
#define _RPINR42_FLT5R2_LENGTH                   0x00000001

#define _RPINR42_FLT5R3_POSITION                 0x00000003
#define _RPINR42_FLT5R3_MASK                     0x00000008
#define _RPINR42_FLT5R3_LENGTH                   0x00000001

#define _RPINR42_FLT5R4_POSITION                 0x00000004
#define _RPINR42_FLT5R4_MASK                     0x00000010
#define _RPINR42_FLT5R4_LENGTH                   0x00000001

#define _RPINR42_FLT5R5_POSITION                 0x00000005
#define _RPINR42_FLT5R5_MASK                     0x00000020
#define _RPINR42_FLT5R5_LENGTH                   0x00000001

#define _RPINR42_FLT5R6_POSITION                 0x00000006
#define _RPINR42_FLT5R6_MASK                     0x00000040
#define _RPINR42_FLT5R6_LENGTH                   0x00000001

#define _RPINR42_FLT6R0_POSITION                 0x00000008
#define _RPINR42_FLT6R0_MASK                     0x00000100
#define _RPINR42_FLT6R0_LENGTH                   0x00000001

#define _RPINR42_FLT6R1_POSITION                 0x00000009
#define _RPINR42_FLT6R1_MASK                     0x00000200
#define _RPINR42_FLT6R1_LENGTH                   0x00000001

#define _RPINR42_FLT6R2_POSITION                 0x0000000A
#define _RPINR42_FLT6R2_MASK                     0x00000400
#define _RPINR42_FLT6R2_LENGTH                   0x00000001

#define _RPINR42_FLT6R3_POSITION                 0x0000000B
#define _RPINR42_FLT6R3_MASK                     0x00000800
#define _RPINR42_FLT6R3_LENGTH                   0x00000001

#define _RPINR42_FLT6R4_POSITION                 0x0000000C
#define _RPINR42_FLT6R4_MASK                     0x00001000
#define _RPINR42_FLT6R4_LENGTH                   0x00000001

#define _RPINR42_FLT6R5_POSITION                 0x0000000D
#define _RPINR42_FLT6R5_MASK                     0x00002000
#define _RPINR42_FLT6R5_LENGTH                   0x00000001

#define _RPINR42_FLT6R6_POSITION                 0x0000000E
#define _RPINR42_FLT6R6_MASK                     0x00004000
#define _RPINR42_FLT6R6_LENGTH                   0x00000001

#define _RPINR43_FLT7R_POSITION                  0x00000000
#define _RPINR43_FLT7R_MASK                      0x0000007F
#define _RPINR43_FLT7R_LENGTH                    0x00000007

#define _RPINR43_FLT7R0_POSITION                 0x00000000
#define _RPINR43_FLT7R0_MASK                     0x00000001
#define _RPINR43_FLT7R0_LENGTH                   0x00000001

#define _RPINR43_FLT7R1_POSITION                 0x00000001
#define _RPINR43_FLT7R1_MASK                     0x00000002
#define _RPINR43_FLT7R1_LENGTH                   0x00000001

#define _RPINR43_FLT7R2_POSITION                 0x00000002
#define _RPINR43_FLT7R2_MASK                     0x00000004
#define _RPINR43_FLT7R2_LENGTH                   0x00000001

#define _RPINR43_FLT7R3_POSITION                 0x00000003
#define _RPINR43_FLT7R3_MASK                     0x00000008
#define _RPINR43_FLT7R3_LENGTH                   0x00000001

#define _RPINR43_FLT7R4_POSITION                 0x00000004
#define _RPINR43_FLT7R4_MASK                     0x00000010
#define _RPINR43_FLT7R4_LENGTH                   0x00000001

#define _RPINR43_FLT7R5_POSITION                 0x00000005
#define _RPINR43_FLT7R5_MASK                     0x00000020
#define _RPINR43_FLT7R5_LENGTH                   0x00000001

