MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define WINDIS_ON            0x00BF
#define WINDIS_OFF           0x00FF

#define FWDTEN_OFF           0x007F
#define FWDTEN_ON            0x00FF

/* Register FPOR (0xf8000c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0xf8000c),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Power-on Reset Timer Value Select bits:
**     FPWRT_PWR1           Disabled
**     FPWRT_PWR2           2ms
**     FPWRT_PWR4           4ms
**     FPWRT_PWR8           8ms
**     FPWRT_PWR16          16ms
**     FPWRT_PWR32          32ms
**     FPWRT_PWR64          64ms
**     FPWRT_PWR128         128ms
**
**   Brown-out Reset (BOR) Detection Enable bit:
**     BOREN_OFF            BOR is disabled
**     BOREN_ON             BOR is enabled
**
**   Alternate I2C pins for I2C1:
**     ALTI2C1_ON           ASDA1/ASCK1 pins are selected as the I/O pins for I2C1
**     ALTI2C1_OFF          SDA1/SCK1 pins are selected as the I/O pins for I2C1
**
**   Alternate I2C pins for I2C2:
**     ALTI2C2_ON           ASDA2/ASCK2 pins are selected as the I/O pins for I2C2
**     ALTI2C2_OFF          SDA2/SCK2 pins are selected as the I/O pins for I2C2
**
*/

#define FPWRT_PWR1           0x0038
#define FPWRT_PWR2           0x0039
#define FPWRT_PWR4           0x003A
#define FPWRT_PWR8           0x003B
#define FPWRT_PWR16          0x003C
#define FPWRT_PWR32          0x003D
#define FPWRT_PWR64          0x003E
#define FPWRT_PWR128         0x003F

#define BOREN_OFF            0x0037
#define BOREN_ON             0x003F

#define ALTI2C1_ON           0x002F
#define ALTI2C1_OFF          0x003F

#define ALTI2C2_ON           0x001F
#define ALTI2C2_OFF          0x003F

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   Reset Target Vector Select bit:
**     RSTPRI_AF            Device will obtain reset instruction from Aux flash
**     RSTPRI_PF            Device will obtain reset instruction from Primary flash
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0x00F4
#define ICS_PGD3             0x00F5
#define ICS_PGD2             0x00F6
#define ICS_PGD1             0x00F7

#define RSTPRI_AF            0x00F3
#define RSTPRI_PF            0x00F7

#define JTAGEN_OFF           0x00D7
#define JTAGEN_ON            0x00F7

/* Register FAS (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FAS;
#define _FAS(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FAS.sec"),space(prog))) __prog__ uint16_t _FAS = (x);

/*
** Only one invocation of FAS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FAS.
** Multiple options may be combined, as shown:
**
** _FAS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Auxiliary Segment Write-protect bit:
**     AWRP_ON              Aux Flash is write protected
**     AWRP_OFF             Aux Flash may be written
**
**   Auxiliary Segment Code-protect bit:
**     APL_ON               Aux Flash Code protect is enabled
**     APL_OFF              Aux Flash Code protect is disabled
**
**   Auxiliary Segment Key bits:
**     APLK_OFF             Aux Flash Write Protection and Code Protection is Disabled
**     APLK_ON              Aux Flash Write Protection or Code Protection is Enabled
**
*/

#define AWRP_ON              0x0032
#define AWRP_OFF             0x0033

#define APL_ON               0x0031
#define APL_OFF              0x0033

#define APLK_OFF             0x0003
#define APLK_ON              0x0033

/* Register FUID0 (0xf80012)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FUID0;
#define _FUID0(x) __attribute__((address(0xf80012),deprecated_definition("consider migrating to #pragma config"),section("__FUID0.sec"),space(prog))) __prog__ uint16_t _FUID0 = (x);

/*
** Only one invocation of FUID0 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID0.
** Multiple options may be combined, as shown:
**
** _FUID0( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/




/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x2aa00

#define __AUXFLASH_BASE 0x7fc000
#define __AUXFLASH_LENGTH 0x3ffa

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

