MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU810/mcu.h
#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FAS_BASE 0xf80010
#define __FAS_LENGTH 0x2

#define __FUID0_BASE 0xf80012
#define __FUID0_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1 6
#define _RPOUT_SS1 7
#define _RPOUT_SS2 10
#define _RPOUT_CSDO 11
#define _RPOUT_CSCK 12
#define _RPOUT_COFS 13
#define _RPOUT_C1TX 14
#define _RPOUT_C2TX 15
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_OC5 20
#define _RPOUT_OC6 21
#define _RPOUT_OC7 22
#define _RPOUT_OC8 23
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_U3TX 27
#define _RPOUT_U3RTS 28
#define _RPOUT_U4TX 29
#define _RPOUT_U4RTS 30
#define _RPOUT_SDO3 31
#define _RPOUT_SCK3 32
#define _RPOUT_SS3 33
#define _RPOUT_SDO4 34
#define _RPOUT_SCK4 35
#define _RPOUT_SS4 36
#define _RPOUT_OC9 37
#define _RPOUT_OC10 38
#define _RPOUT_OC11 39
#define _RPOUT_OC12 40
#define _RPOUT_OC13 41
#define _RPOUT_OC14 42
#define _RPOUT_OC15 43
#define _RPOUT_OC16 44
#define _RPOUT_SYNCO1 45
#define _RPOUT_SYNCO2 46
#define _RPOUT_QEI1CCMP 47
#define _RPOUT_QEI2CCMP 48
#define _RPOUT_REFCLK 49

#endif
